In [1]:
import pandas as pd
import numpy as np

In [2]:
rawdata=pd.read_excel(r"C:\Users\vishw\Downloads\Address_RawData.xlsx")

In [4]:
rawdata.head(3)

,Address,Date,Name,Time
0,"27th Cross, Shree Colony, Electronic City, Ban...",3rd Mar 2001,Baxter Rasmussen Group,15:14:07
1,"1st Street, SBI Colony, Kukatpally, Hyderabad ...",15th Jun 2002,Lozano Vega-Gentry,11:49:23
2,"14th Main, BTM Colony, Mysore Road, Bangalore ...",28th Feb 2003,Berry Murillo-Perry,09:27:05

In [7]:
rawdata['Address']

0     27th Cross, Shree Colony, Electronic City, Ban...
1     1st Street, SBI Colony, Kukatpally, Hyderabad ...
2     14th Main, BTM Colony, Mysore Road, Bangalore ...
3     3rd Avenue, Srinagar Colony, Banjara Hills, Hy...
4     42nd Street, Patel Colony, Vadapalani, Chennai...
5     8th Cross, Raghavendra Colony, JP Nagar, Banga...
6     22nd Road, Sai Colony, Gachibowli, Hyderabad -...
7     11th Street, Sarojini Colony, T Nagar, Chennai...
8     5th Main, Vivekananda Colony, Rajajinagar, Ban...
9     31st Avenue, Venkateshwara Colony, Kondapur, H...
10    46th Street, Lakshmi Colony, Adyar, Chennai - ...
11    9th Cross, Shiva Colony, Peenya, Bangalore - 5...
12    24th Road, Gayatri Colony, Manikonda, Hyderaba...
13    17th Street, Rama Colony, Velachery, Chennai -...
14    6th Main, Annapurna Colony, Yelahanka, Bangalo...
15    35th Avenue, Siva Sankara Colony, Secunderabad...
16    28th Street, Lakshmi Narasimha Colony, Guntur,...
17    4th Cross, Raghavendra Colony, Vijayanagar, Ba...
18    19th Road, Srinivasa Colony, Ameerpet, Hyderab...
19    12th Street, Thiruvalluvar Colony, Tambaram, C...
20    8th Main, Mahalakshmi Colony, Koramangala, Ban...
21    25th Avenue, Venkatadri Colony, Kavadiguda, Hy...
22    43rd Street, Vivekananda Colony, Chrompet, Che...
23    15th Cross, Rama Krishna Colony, Mathikere, Ba...
24    32nd Road, Siva Parvathi Colony, Kompally, Hyd...
25    6th Street, Shanthi Colony, Anna Nagar, Chenna...
26    21st Main, Geetha Colony, Jalahalli, Bangalore...
27    38th Avenue, Anantha Padmanabha Colony, Malkaj...
Name: Address, dtype: object

In [9]:
newadd=rawdata['Address'].str.split(r"[,-]",expand=True)

In [11]:
newadd.head(3)

            0              1                 2            3        4
0  27th Cross   Shree Colony   Electronic City   Bangalore    560100
1  1st Street     SBI Colony        Kukatpally   Hyderabad    500072
2   14th Main     BTM Colony       Mysore Road   Bangalore    560026

In [15]:
newadd.columns=['houseno','colony','area','city','pincode']

In [17]:
newadd.head()

       houseno            colony              area         city  pincode
0   27th Cross      Shree Colony   Electronic City   Bangalore    560100
1   1st Street        SBI Colony        Kukatpally   Hyderabad    500072
2    14th Main        BTM Colony       Mysore Road   Bangalore    560026
3   3rd Avenue   Srinagar Colony     Banjara Hills   Hyderabad    500034
4  42nd Street      Patel Colony        Vadapalani     Chennai    600026

In [19]:
rawdata['Date']

0      3rd Mar 2001
1     15th Jun 2002
2     28th Feb 2003
3     12th Oct 2004
4     25th Dec 2005
5     17th Apr 2006
6     29th Jan 2007
7      8th Aug 2008
8     22nd Nov 2009
9      5th Sep 2010
10    10th May 2011
11    31st Jul 2012
12    24th Mar 2013
13     2nd Feb 2014
14    19th Oct 2015
15    14th Jun 2016
16     7th Jan 2017
17    26th Apr 2001
18     9th Mar 2005
19     1st Jul 2009
20    18th Sep 2012
21    11th Dec 2013
22    28th May 2014
23     4th Jan 2015
24    20th Feb 2016
25    15th Aug 2010
26     8th Nov 2011
27    31st Dec 2012
Name: Date, dtype: object

In [29]:
newdd=rawdata['Date'].str.split(r" ",expand=True)

In [31]:
newdd.head(1)

     0    1     2
0  3rd  Mar  2001

In [33]:
newdd.columns=['day','month','year']

In [35]:
newdd.head(2)

    day month  year
0   3rd   Mar  2001
1  15th   Jun  2002

In [58]:
newtime=rawdata['Time'].astype(str).str.split(r':',expand=True)

In [60]:
newtime.columns=['hours','minutes','times']

In [62]:
newtime.head(2)

  hours minutes times
0    15      14    07
1    11      49    23

In [91]:
cleandata=pd.concat([newadd,newdd,newtime],axis=1)

In [96]:
cleandata.head(3)

,houseno,colony,area,city,pincode,day,month,year,hours,minutes,times
0,27th Cross,Shree Colony,Electronic City,Bangalore,560100,3rd,Mar,2001,15,14,07
1,1st Street,SBI Colony,Kukatpally,Hyderabad,500072,15th,Jun,2002,11,49,23
2,14th Main,BTM Colony,Mysore Road,Bangalore,560026,28th,Feb,2003,09,27,05